---
kind: property
id: P:Autodesk.Revit.DB.ViewOrientation3D.ForwardDirection
source: html/225b68cf-de90-8e5f-f2b2-0b9b95a245f8.htm
---
# Autodesk.Revit.DB.ViewOrientation3D.ForwardDirection Property

The forward direction vector

## Syntax (C#)
```csharp
public XYZ ForwardDirection { get; }
```